import { ref ,computed} from 'vue'
import { defineStore } from 'pinia'

export const product = defineStore('product', () => {
const productList = ref([
  {name:'Anchor Pure Butter',type:'เนยสดรสจืด',price:179,img:'https://image.bestreview.asia/wp-content/uploads/2023/05/best-butter-1-300x300.jpg',discription:"Anchor Pure Butter เป็นเนยที่ทุกคนจะต้องรู้จักและชื่นชอบอย่างแน่นอนค่ะ เพราะเนยจากแบรนด์นี้หาซื้อได้ง่ายผู้เขียนเองก็ชอบซื้อเพื่อนำมาทำขนมอยู่บ่อย ๆ ค่ะ สำหรับเนยของทางแบรนด์มีทั้งเนยเค็มและเนยจืดค่ะ ส่วนที่เรานำมาแนะนำกันในวันนี้เป็นเนยจืดที่มีความอเนกประสงค์ จะใช้เพื่อปรุงอาหารคาวก็ได้หรือทำของหวานก็ดีค่ะ รสชาติของเนยมีความครีมมี่ มีกลิ่นหอมและราคาของเนยก็ไม่แพงด้วยค่ะจากข้อมูลที่ทางแบรนด์ให้มาคือทางแบรนด์ Anchor ใช้นมจากวัวที่เลี้ยงในทุ่งหญ้า ไม่มีสารปรุงแต่งและวัตถุกันเสียทำให้เนยมีความปลอดภัยที่จะใช้งานมากขึ้นค่ะ นอกจากนี้เนยจากแองเคอร์ยังเหมาะสำหรับคนที่ทานคีโตด้วยค่ะเพราะในส่วนผสมของเนยแท้ถึง 98.5% ค่ะ ใครอยากซื้อเนยเพื่อทำแพนเค้กหรือจะเอาไว้ทอดไส้กรอกหอม ๆ ในตอนเช้าแนะนำค่ะ"},
  {name:'Westgold ',type:'เนยสดรสเค็ม',price:137,img:'https://image.bestreview.asia/wp-content/uploads/2023/05/best-butter-2-300x300.jpg',discription:"แนะนำ Anchor Pure Butter กันไปแล้วก็ถึงคิวเนยจาก Westgold กันบ้างค่ะเพราะเนยจากทางแบรนด์เป็นเนยจากนิวซีแลนด์เหมือนกัน ในการผลิตเนยทางแบรนด์ใช้กรรมวิธี Fritz Churn เป็นกรรมวิธีดั้งเดิมที่ปราศจากสารเคมีทำให้เนยมีกลิ่นหอมละมุนอย่างเป็นธรรมชาติ ผู้เขียนชอบวิธีการผลิตเนยจากทางแบรนด์มากค่ะเพราะทำจากครีมพาสเจอร์ไรส์ซึ่งมีถิ่นกำเนิดในนิวซีแลนด์และเป็นครีมที่มีรสชาติดีที่สุดด้วยเนยจากทางแบรนด์มีให้เลือกทั้งเนยจืดและเนยเค็มค่ะ แต่เนยที่เรานำมาแนะนำกันในวันนี้เป็นเนยเค็มค่ะเหมาะสำหรับใช้ทาขนมปังเพื่อเป็นอาหารเช้า เนยมีความเข้มข้น มีเนื้อนุ่มและมีกลิ่นหอมที่จะดึงดูดใจตั้งแต่เราเปิดฟอยล์เลยค่ะ ในเนยจะมีส่วนผสมของครีม 99% และมีเกลือ 1% ค่ะ ถึงแม้จะเป็นเนยเค็มแต่ก็ยังมีความหอมมันของเนยอยู่ค่ะ"},
  {name:'Allowrie',type:'เนยจืด',price:130,img:'https://image.bestreview.asia/wp-content/uploads/2023/05/best-butter-3-2-300x300.jpg',discription:'Allowrie เป็นเนยอีกหนึ่งแบรนด์ที่หาซื้อได้ง่ายค่ะ เนยที่เราแนะนำเป็นเนยจืดและมีรสชาติอ่อน ๆ ค่ะ ส่วนผสมหลักของเนยจากทางแบรนด์มีความแตกต่างจาก Anchor Pure Butter และเนยจาก Westgold อยู่นิดหน่อยในเรื่องของส่วนผสมค่ะเพราะส่วนผสมหลักของเนยจาก Allowrie ไม่ใช่ครีมแต่เป็นน้ำมันเนยค่ะ แต่แน่นอนว่ามันก็คือเนยเหมือนกัน รสชาติของเนยจะแตกต่างกันอยู่หน่อยเพราะเนยจาก Allowrie จะมีความมันกว่าเนยอื่น ๆตัวเนยจะเหมาะสำหรับใช้ใส่ในขนมอบหรือทาบนมัฟฟินค่ะ อีกทั้งในเนยยังไม่มีวัตถุกันเสียด้วยค่ะรับรองว่าปลอดภัยเมื่อทานอย่างแน่นอน เนื่องจากเป็นเนยจืดทำให้เนยมีความอเนกประสงค์ค่ะ นอกจากจะใช้ทาและทำขนมแล้วเรายังสามารถใช้เนยเป็นส่วนผสมเพื่อทำเนยกระเทียมหรือใช้ทำสเปรดเพื่อเพิ่มรสชาติให้กับหมู เนื้อวัวหรือไก่ย่างก็ได้เหมือนกันค่ะ'},
  {name:'Lurpak Butter',type:'เนยจืด',price:322,img:'https://image.bestreview.asia/wp-content/uploads/2023/05/best-butter-4-300x300.jpg',discription:'สำหรับเนยตัวนี้เป็นเนยจาก Lurpak ค่ะ คนที่ชอบทำขนมจะต้องรู้จักเนยจากแบรนด์นี้อย่างแน่นอนค่ะเพราะ Lurpak เป็นเนยจากเดนมาร์กค่ะ ความพิเศษของเนยคือทำจากนมแท้ ๆ 100% ไม่ได้เพิ่มอะไรลงไปในเนยเลย ส่งผลให้เนยมีกลิ่นหอมสดชื่นพร้อมเนื้อครีมที่เนียนนุ่มค่ะ เนยจากทางแบรนด์อาจมีรสชาติไม่เหมือนเนยอื่น ๆ ค่ะเพราะ Lurpak จะเพิ่มแลคติกลงไปเพื่อหมักครีมแต่รับรองว่าเป็นเนยที่อร่อยแน่เนยจืดจาก Lurpak สามารถใช้งานได้อย่างอเนกประสงค์ค่ะจะใช้ทานกับขนมปังปิ้งหรือแพนเค้กในตอนเช้าก็ได้หรือจะใช้เพื่อทำอาหารคาวก็ดีค่ะ สำหรับใครที่ชอบเนยที่ไม่หวานเกินไป มีกลิ่นหอมและมีคุณภาพพรีเมียมแนะนำเลยค่ะ รับรองว่าใช้งานแล้วจะไม่ผิดหวังแน่ค่ะ'},
  {name:'Golden Churn Butter Canned',type:'เนยเค็ม',price:290,img:'https://image.bestreview.asia/wp-content/uploads/2023/05/best-butter-5-300x300.jpg',discription:'Golden Churn Butter Canned เป็นเนยที่มีต้นกำเนิดจากประเทศออสเตรเลียค่ะ สำหรับเนยจาก Golden Churn เป็นเนยที่คนไทยเรียกว่าเนยถังทองค่ะ นอกจากจะขายดีในไทยแล้วเนยจากทางแบรนด์ยังขายดีแถวเอเชียและตะวันออกกลางกลางด้วย ความลับพิเศษที่ทำให้เนยจากทางแบรนด์แตกต่างจากเนยแบรนด์อื่น ๆ ค่ะ เพราะเนยใช้กระบวนการผลิตอย่างดีและใช้ครีมพาสเจอร์ไรส์เป็นส่วนผสมเพื่อทำให้เนยมีรสชาติที่น่ารับประทานมากยิ่งขึ้นตัวเนยที่เราแนะนำเป็นเนยเค็มค่ะเหมาะสำหรับใช้ทาขนมปัง บิสกิสและคุกกี้ หลายคนที่เคยซื้อมาแล้วบอกเป็นเสียงเดียวกันเลยว่าเนยหอมมาก นอกจากนี้เนยจาก Golden Churn ยังไม่ผสมสารเติมแต่งอื่น ๆ ใช้เพียงน้ำและเกลือเพื่อให้เนยมีรสชาติอร่อยและโดดเด่นมากขึ้น แพ็กเกจของเนยเป็นแบบกระป๋องสามารถเก็บเนยได้นานมาก อีกทั้งยังมีเครื่องหมายฮาลาลรองรับด้วยค่ะ ใครที่อยากซื้อเนยรสชาติดีและได้รับความนิยมแนะนำเลยค่ะ'},
  {name:'Balentine Salted Butter',type:'เนยเค็ม',price:179,img:'https://image.bestreview.asia/wp-content/uploads/2023/05/best-butter-6-300x300.jpg',discription:'Balentine Salted Butter เนยเค็มจากออสเตรเลียที่เราอยากแนะนำค่ะ ตัวเนยมีกระบวนการทำเนยคล้าย ๆ กับเนยจาก Lurpak ค่ะเพราะในเนยมีการผสมกรดแลกติกลงไปด้วยในระหว่างการผลิตครีมทำให้เนยมีรสชาติที่อร่อยและโดดเด่นมากยิ่งขึ้น รสชาติของเนยมีความอร่อยและกลมกล่อม เนื้อสัมผัสของเนยเนียนนุ่มทำให้ใช้งานได้ง่ายมาก สีของเนยจะเป็นสีเหลืองทองจากธรรมชาติเลยค่ะไม่มีการแต่งสีแต่งกลิ่นเนยเค็มจากทางแบรนด์สามารถใช้ทำได้หลากหลายเมนูเลยค่ะจะใช้ทาขนมปังเปล่า ๆ ก็ได้หรือจะใช้เป็นส่วนผสมสำหรับขนมอบหรืออาหารคาวอื่น ๆ ได้เช่นเดียวกันค่ะ นอกจากเนยเค็มแล้วทางแบรนด์ยังมีเนยจืดให้เราได้เลือกด้วย ปริมาณของเนยอยู่ที่ 250 กรัมค่ะราคาไม่แพงเลยห้ามพลาดเลยค่ะ'},
  {name:'Elle&Vire',type:'เนยจืด ',price:460,img:'https://image.bestreview.asia/wp-content/uploads/2023/05/best-butter-7-300x300.jpg',discription:'Elle&Vire เป็นเนยที่หลายคนรู้จักกันดีเลยค่ะ เพราะแบรนด์ Elle & Vire เป็นแบรนด์ดังจากฝรั่งเศสค่ะ เนยจากทางแบรนด์มีให้เลือกทั้งเนยจืดและเนยเค็มค่ะสามารถเลือกแบบไหนก็ได้เลย แต่วันนี้เราจะมาแนะนำเนยจืดค่ะ สามารถใช้สำหรับผัดอาหาร ใช้ผสมเพื่อทำซอส ใช้ทำขนมอบหรือจะใช้ทำเค้กก็ได้ค่ะ โดยความพิเศษของเนยจากทางแบรนด์คือมีไขมันค่อนข้างต่ำกว่าเนยจากแบรนด์อื่น ๆ ค่ะเนยจาก Elle & Vire คัดสรรวัตถุดิบครีมจากฝรั่งเศสที่ให้รสชาติอร่อยในทุกมื้ออาหารที่เราทำ ในการใช้งานจะทาเนยบนขนมปังในมื้อเช้าก็ได้ค่ะเพราะเข้มข้นและอร่อยมาก ๆ เลย ปริมาณของเนยมีให้เลือกทั้ง 250 กรัมไปจนถึง 1 กิโลกรัมค่ะสามารถเลือกซื้อได้ตามความต้องการเลยค่ะ'},
  {name:'Imperial',type:'เนยจืด',price: 184 ,img:'https://image.bestreview.asia/wp-content/uploads/2023/05/best-butter-8-300x300.jpg',discription:'ถัดมาเป็นเนยจาก Imperial ค่ะ หลายคนคุ้นเคยกับแบรนด์นี้ค่ะเพราะทางแบรนด์ผลิตอาหารหลายอย่างมาก ๆ ที่ทางเบสท์รีวิวได้แนะนำไปแล้วมีทั้งคุกกี้อิมพีเรียลและแป้งทำขนมอิมพีเรียลค่ะ สำหรับเนยจากอิมพีเรียลส่วนใหญ่จะเป็นเนยผสมค่ะ แต่ก็มีเนยแท้เหมือนกันสำหรับเนยสูตรนี้ที่เราแนะนำกันเป็นเนยจืดค่ะเหมาะสำหรับใช้ทาขนมปังมาก ๆ เพราะเป็นสูตร Spreadable ค่ะเนื้อนุ่มกว่าเนยทั่วไปและเกลี่ยได้ง่ายกว่าด้วยคำเคลมที่ทางแบรนด์ให้มาคือเมื่อนำออกมาจากตู้เย็นแล้วสามารถเกลี่ยได้เลยไม่ต้องรอเวลาค่ะ นอกจากจะใช้ทาขนมแล้วเนยยังสามารถใช้แทนน้ำมันเพื่อทำอาหารคาวได้ด้วยนะคะ ผู้เขียนค่อนข้างชอบแพ็กเกจของเนยเลยค่ะเพราะทำให้เราสามารถจัดเก็บเนยได้ง่ายมากกว่าแบบฟอยล์ค่ะ'},
  {name:'Healtholicious Grass-Fed Ghee',type:'เนยใส',price:729,img:'https://image.bestreview.asia/wp-content/uploads/2023/05/best-butter-9-300x300.jpg',discription:'Healtholicious Grass-Fed Ghee เป็นเนยที่แตกต่างจากเนยเค็มและเนยจืดที่เราได้แนะนำกันไปค่ะ โดยเนยตัวนี้เป็นเนยใสหรือที่เราเรียกกันว่า “กี” ค่ะ เนยใสจากทางแบรนด์เป็นทางเลือกที่ดีมากหากคุณแพ้นมวัวเพราะผลิตภัณฑ์ผ่านกรรมวิธีพิเศษจนนมเหลือแต่ไขมันบริสุทธิ์ ด้วยเหตุนี้ผลิตภัณฑ์เนยใสจากทางแบรนด์จึงปราศจากเคซีนและแลคโตสค่ะเนยจาก Healtholicious เป็นเนยจากนิวซีแลนด์ค่ะ นอกจากจะไม่มีแลคโตสแล้วเนยจากทางแบรนด์ยังเป็นเนยที่ได้มาจากนมคุณภาพดี เพราะวัวที่เลี้ยงเป็นวัวที่กินหญ้าสดตามธรรมชาติไม่ใช่วัวเลี้ยงค่ะ อีกทั้งเนยยังทนความร้อนได้สูง 250 องศา เมื่อซื้อมาแล้วจะสามารถใช้เนยทำของคาวก็ได้ ทำของหวานก็ดีหรือจะใช้กับเครื่องดื่มก็ได้เช่นเดียวกันค่ะ'},
  {name:'President',type:'เนยเค็ม',price:355,img:'https://image.bestreview.asia/wp-content/uploads/2023/05/best-butter-10-300x300.jpg',discription:'นอกจากจะมีเนยจาก Elle&Vire ที่ผลิตในฝรั่งเศสแล้วก็ยังมีเนยจาก President ที่ผลิตในฝรั่งเศสเหมือนกันค่ะ เนยจากทางแบรนด์มีให้เลือกทั้งเนยจืดและเนยเค็มค่ะ แต่แพ็กเกจที่เรานำมาแนะนำหันในวันนี้เป็นเนยเค็มที่เก็บไว้ใช้ได้นานมาก เนยมีให้เลือกหลายปริมาณค่ะสามารถเลือกซื้อได้ตามความต้องการเลย ราคาของเนยไม่ได้แพงมากเลยค่ะเท่า ๆ กับเนยทั่วไปในตลาดเนยผลิตในโรงงานจากนอร์มังดีค่ะ โดยทางแบรนด์ได้ใช้นม ใช้ครีมที่ดีที่สุดและมีปริมาณไขมันสูงเพื่อให้เนยมีรสชาติที่อร่อยและเข้มข้น จึงเหมาะอย่างยิ่งสำหรับใช้ในการทำเบเกอรี่ ใช้ทำซอส ใช้ทาบนขนมปังปิ้งหรือจะใช้ทาบนแคร็กเกอร์ก็ได้เหมือนกันค่ะ ใครที่อยากซื้อเนยจากฝรั่งเศสต้องห้ามพลาดเลยนะคะ'}
])

 
const cartList = ref([]);
const orderprice = ref([])
const orderList = ref([]);
function orderadd(list,summary) {
  orderList.value.push(list);
  orderprice.value.push(summary);

  // Clear the cartList
  cartList.value = [];
}

const id = ref(0);
const sumcart = computed(() => {
  return cartList.value.reduce((accumulator, currentValue) => {
    return accumulator + currentValue.count; // Assuming your cart items have a 'count' property
  }, 0 );
});

const sumprice = computed(() => {
  return cartList.value.reduce((accumulator, currentValue) => {
    return accumulator + currentValue.price* currentValue.count; // Assuming your cart items have a 'count' property
  }, 0 );
});

function add(name,price,count,img) {
  const item = {
    name: name,
    price: price,
    count:count,
    img:img
  }
  const findId = cartList.value.find(e => e.name == item.name)
  if(findId) {
    const findIndexProduct = cartList.value.findIndex(e => e.name == item.name)
    cartList.value[findIndexProduct].count = cartList.value[findIndexProduct].count + count
} else {
  cartList.value.push(item)
}
}

const delcart = (i) => { 
  cartList.value.splice(i, 1)
}
  function idcard(i){
    id.value = i
  }


  return { productList, cartList, orderList, id ,sumcart , sumprice , orderprice , delcart, idcard, add, orderadd }
})
